tutorialsDyM/FallingSphereSuspensionMorphing/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs            ("liboverset.so");

application     overSedDymFoam_rbgh;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.7;

deltaT          1e-6;

writeControl    adjustableRunTime;

writeInterval   1e-2;

purgeWrite      0;

writeFormat     binary;

writePrecision  9;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.01;

maxAlphaCo           0.01;

maxDeltaT       2.0e-5;

functions
{
forces1
{
    type          forcesSed;
    libs          ("libforcesSedFoam.so");
    writeControl  timeStep;
    timeInterval  1;
    log           yes;
    patches       ("sphere");
    rho           rhoInf;     // Indicates incompressible
    log           true;
    rhoInf        970; // Redundant for incompressible
    origin (0 0 0); 
    rotation
        {
            type            axes;
            e3              (0 0 1);
            e1              (1 0 0);
        }
}
}


// ************************************************************************* //
